import q2021_1 from "./2021_1";
import q2021_2 from "./2021_2";
import q2021_3 from "./2021_3";
import q2022_1 from "./2022_1";
import q2022_2 from "./2022_2";
import q2022_3 from "./2022_3";
import q2023_1 from "./2023_1";
import q2023_2 from "./2023_2";
import q2023_3 from "./2023_3";
import q2024_1 from "./2024_1";
import q2024_2 from "./2024_2";
import q2024_3 from "./2024_3";
import q2025_1 from "./2025_1";
import q2025_2 from "./2025_2";
import q2025_3 from "./2025_3";

// 모든 기출문제를 모아두는 곳
// "키값": 데이터파일
const allQuestions: any = {
  "2021-1": q2021_1,
  "2021-2": q2021_2,
  "2021-3": q2021_3,
  "2022-1": q2022_1,
  "2022-2": q2022_2,
  "2022-3": q2022_3,
  "2023-1": q2023_1,
  "2023-2": q2023_2,
  "2023-3": q2023_3,
  "2024-1": q2024_1,
  "2024-2": q2024_2,
  "2024-3": q2024_3,
  "2025-1": q2025_1,
  "2025-2": q2025_2,
  "2025-3": q2025_3,
  // 나중에 3회차 추가하면 여기에 "2021-3": q2021_3, 이렇게 추가하면 됨!
};

export default allQuestions;